In [1]:
import pandas as pd

In [3]:
df = pd.read_csv('ejemplo3.csv')
df

   ID Nombre  Edad     Color
0   1    Ana    25      Azul
1   2  Pablo    25     Verde
2   3  Cobra    28      Rojo
3   4  Sofia    32  Amarillo
4   5   Luis    30      Azul

In [8]:
df['LongitudNombre'] = df['Nombre'].apply(len)
df

   ID Nombre  Edad     Color  Len_Nombre CodigoColor  LongitudNombre
0   1    Ana    25      Azul           3     #0000FF               3
1   2  Pablo    25     Verde           5     #00FF00               5
2   3  Cobra    28      Rojo           5     #FF0000               5
3   4  Sofia    32  Amarillo           5     #FFFF00               5
4   5   Luis    30      Azul           4     #0000FF               4

In [7]:
color_map = {
    'Azul': '#0000FF',
    'Verde': '#00FF00',
    'Rojo': '#FF0000',
    'Amarillo': '#FFFF00'
    }

df["CodigoColor"] = df['Color'].map(color_map)
df

   ID Nombre  Edad     Color  Len_Nombre CodigoColor
0   1    Ana    25      Azul           3     #0000FF
1   2  Pablo    25     Verde           5     #00FF00
2   3  Cobra    28      Rojo           5     #FF0000
3   4  Sofia    32  Amarillo           5     #FFFF00
4   5   Luis    30      Azul           4     #0000FF

In [9]:
#filtrar las filas cuya edad sea igual a 25 0 35 utilizando hay dos formas la segunda es con isin

df[(df['Edad'] == 25) | (df['Edad'] == 35)]

   ID Nombre  Edad  Color  Len_Nombre CodigoColor  LongitudNombre
0   1    Ana    25   Azul           3     #0000FF               3
1   2  Pablo    25  Verde           5     #00FF00               5

In [10]:
#is edad in [25,35] -> python
df[df['Edad'].isin([25, 35])]

   ID Nombre  Edad  Color  Len_Nombre CodigoColor  LongitudNombre
0   1    Ana    25   Azul           3     #0000FF               3
1   2  Pablo    25  Verde           5     #00FF00               5

In [11]:
#filtrar las filas cuya edad este en un rango de 28 y 32, dos opciones
df[(df['Edad']>=28) & (df['Edad']<=32)]

   ID Nombre  Edad     Color  Len_Nombre CodigoColor  LongitudNombre
2   3  Cobra    28      Rojo           5     #FF0000               5
3   4  Sofia    32  Amarillo           5     #FFFF00               5
4   5   Luis    30      Azul           4     #0000FF               4

In [12]:
df[df['Edad'].between(28, 32)]

   ID Nombre  Edad     Color  Len_Nombre CodigoColor  LongitudNombre
2   3  Cobra    28      Rojo           5     #FF0000               5
3   4  Sofia    32  Amarillo           5     #FFFF00               5
4   5   Luis    30      Azul           4     #0000FF               4

In [13]:
#Filtrar las filas  cuyo nombre empieza con A
df[df['Nombre'].str.startswith('A')]

   ID Nombre  Edad Color  Len_Nombre CodigoColor  LongitudNombre
0   1    Ana    25  Azul           3     #0000FF               3

In [14]:
#Filtrar las filas donde el nombre tiene mas de 4 caracteres 
df[df['Nombre'].apply(len)>4]

   ID Nombre  Edad     Color  Len_Nombre CodigoColor  LongitudNombre
1   2  Pablo    25     Verde           5     #00FF00               5
2   3  Cobra    28      Rojo           5     #FF0000               5
3   4  Sofia    32  Amarillo           5     #FFFF00               5